tutorials/plastic_cases/surface_deformation/surface_deformation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

wetting 
{
    transportModel  Newtonian; 
    nu              [0 2 -1 0 0 0 0] 1.76e-5; 
    rho             [1 -3 0 0 0 0 0] 1;
}

nonWetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 5e-6;  //1.76e-5;
    rho             [1 -3 0 0 0 0 0] 1000;
}

transportModel  HerschelBulkleyQuemada; 
   
    HerschelBulkleyQuemadaCoeffs
    {
	nu0      [ 0 2 -1 0 0 0 0 ] 1e05;      
        tau0     [ 0 2 -2 0 0 0 0 ] 0.22; // = 350 Pa/rhos divided by 1.67 from Quemada scaling. 
	epssMax  [ 0 0 0 0 0 0 0 ] 0.74;
        nuf        [ 0 2 -1 0 0 0 0 ] 1e-6;   //viscosity of water
	Dstar    [ 0 0 0 0 0 0 0 ] 1.1; //Dimension parameter
        n        [ 0 0 0 0 0 0 0 ] 1;   // Power law (if 1 its just Bingham model)
        m        [ 0 0 0 0 0 0 0 ] 0.4;  
	Beta     [ 0 0 0 0 0 0 0 ] 8;  
    }

//Solid Phase Stuff

activateSolidMechanics 1;
rho_s           [1 -3 0 0 0 0 0]  2650; //1600     

//Two Phase Stuff
activateCapillarity            0;
activatePorousContactAngle     0;
theta0                         180;

sigma            [1 0 -2 0 0 0 0]  0.063;
invFk0           [0 -2 0 0 0 0 0]  1.92e4; // (b^2)/12

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  VanGenuchten;
capillarityModel           BrooksAndCorey;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    m 0.05;
}

BrooksAndCoreyCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 1000;
    alpha 0.001;
}

// ************************************************************************* //
