tutorials/plastic_cases/surface_deformation/surface_deformation/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  // 6-actions patch generation: cut out 'inlet' faces from 'top' 
    { 
        name    inlet; 
        type    faceSet; 
        action  new; 
        source  patchToFace; 
        sourceInfo 
        { 
            name "bottom"; 
        } 
    } 


    // cutting a teporary volume of the size of the inlet 
    { 
        name    tempset1; 
        type    cellSet; 
        action  new; 
        source  boxToCell; 
        sourceInfo 
        { 
            box (0.245 -0.001 -1)(0.255 0.001 1); 
        } 
    } 

    // selecting the faces belonging to the cut volume 
    { 
        name    tempset2; 
        type    faceSet; 
        action  new; 
        source  cellToFace; 
        sourceInfo 
        { 
            set       tempset1; 
            option    all;    //Is there not better option, like only selecting boundary faces? 
        } 
    } 

    // temporary copy of the "top" boundary faces 
    { 
        name    tempset3; 
        type    faceSet; 
        action  new; 
        source  faceToFace; 
        sourceInfo 
        { 
            set "inlet"; 
        } 
    } 

    // removing the leftInlet faces from the top-faces-clone by taking the faces from the cut volume and substracting them from the boundary faces. This results in a "negative" of the actual inlet
    { 
        name    tempset3; 
        type    faceSet; 
        action  delete; 
        source  faceToFace; 
        sourceInfo 
        { 
            set "tempset2"; 
        } 
    } 

    // final leftInlet patch = top-faces - tempset3 
    //you remove all the faces that are not part of the inlet (the negative) from your face set,     leaving you with the desired faces. 
    { 
        name    inlet; //this is the final result to use in createPatchDict ! 
        type    faceSet; 
        action  delete; 
        source  faceToFace; 
        sourceInfo 
        { 
            set "tempset3"; 
        } 
    } 

///

//blockMesh
//topoSet
//createPatch -overwrite

);

// ************************************************************************* //
